// **Задача 14:**

// Напишите программу, которая принимает на вход число и проверяет,
//  кратно ли оно одновременно 7 и 23.
//if (a > g)
//if((a > b || a < c) && (x > b || x < c) || d == 5) <=> 0 && 1 || d == 5
//     0    +    0          1    +   0
 //         0          *         1
 //                    0                   +   1
 //                                1    
// 14  ->  нет
// 46  ->  нет
// 161 ->  да

Console.Clear();
Console.Write("Введите число 1 -> ");
int num1 = Convert.ToInt32(Console.ReadLine());
if ((num1%7 == 0)&&(num1%23 == 0))
{
    Console.Write($"Наше число {num1} кратно 7 и 23");
}
else
{
    Console.Write($"Наше число {num1} не кратно 7 и 23");
}
