// **Задача 18:
        // Напишите программу, которая по заданному номеру четверти, 
        // показывает диапазон возможных координат точек в этой четверти (x и y).
Console.WriteLine("Введите номер четверти ");
int N = int Parse.(Console.ReadLine());
if( N == 1)
{
    Console.WriteLine("x>0 y>0");
}
else

if( N == 2)
{
     Console.WriteLine("x<0 y<0");
     
} 